literate/BlockTests.org
#+TITLE: Block Tests
#+PROPERTY: header-args    :comments both :tangle ../test/Block.test.js

* Preamble

#+begin_src js
import { ValueBlock, Tape, OpBlock, Category } from "../src/Block";
import { Token } from "../src/LexicalToken";
#+end_src

* Basics 
#+begin_src js
it("Basic value block", () => {
    const token = Token.Blank();
    const block = ValueBlock(token);
    expect(block.token).toEqual(token);
    expect(block.asJS()).toEqual(null);
    expect(block.is(Category.Value)).toBe(true);
})
#+end_src

#+begin_src js
it("Basic op block", () => {
    const token = Token.CallIdentifier("abcd!");
    const block = OpBlock(token);
    expect(block.token).toEqual(token);
    expect(block.is(Category.Op)).toBe(true);
    expect(block.category.name).toBe("Op");
})
#+end_src

#+begin_src js
it("Basic tape", () => {
    const token = Token.Blank();
    const block = ValueBlock(token);
    const tape = Tape();
    
    tape.append(block);
    
    expect(tape.cells.length).toBe(1);
    expect(tape.cells[0]).toEqual(block);
    expect(tape.is(Category.Value)).toBe(true);
    expect(tape.asJS()).toEqual([ null ]);
})
#+end_src
